### Pandas Practice session 2

### Index objects

In [5]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [20]:
my_ser = Series([1,2,3,4],index=['A','B','C','D'])

In [23]:
my_ser.name = "Test series"

In [24]:
my_ser.index.name = "Index"

In [25]:
my_ser

Index
A    1
B    2
C    3
D    4
Name: Test series, dtype: int64

In [26]:
my_index = my_ser.index

In [38]:
my_index # This is similar to list. All operations similar to list can be done except that index is immutable

Index(['A', 'B', 'C', 'D'], dtype='object', name='Index')

In [36]:
my_index[::-1]

Index(['D', 'C', 'B', 'A'], dtype='object', name='Index')

In [41]:
my_index[0] == 'A'

True

In [44]:
'X' in my_index

False

### ReIndexing

In [46]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [49]:
ser1 = Series([1,2,3,4],index=['A','B','C','D'])

In [50]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [52]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])

In [54]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [58]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value = 0) #fill_value will fill default value to new index

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [60]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

In [62]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [69]:
ranger = list(range(15))

In [71]:
ranger

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [75]:
ser3.reindex(ranger,method='ffill')  #ffil = forward fill

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [78]:
ser3.reindex(ranger,method='bfill')  #bfill = backward fill

0        USA
1     Mexico
2     Mexico
3     Mexico
4     Mexico
5     Mexico
6     Canada
7     Canada
8     Canada
9     Canada
10    Canada
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [81]:
randn(25).reshape([5,5])

array([[ 2.03814655,  0.00301101,  0.4860551 , -0.15144214, -0.3336449 ],
       [-1.25319051, -0.94107953,  0.28016526,  0.11818229,  0.84109627],
       [ 0.93451518,  0.83661022,  0.82771821, -1.16806456,  1.37205162],
       [-0.18053465,  0.31802489,  0.62093922,  1.84742317,  1.06496718],
       [-0.10432009, -0.91565971,  0.0527229 ,  0.36960669, -1.03764767]])

In [82]:
dframe = DataFrame(randn(25).reshape([5,5]),index=['A','B','D','E','F'],
                   columns=['col1','col2','col3','col4','col5'])

In [85]:
dframe

       col1      col2      col3      col4      col5
A -0.424867 -0.686707 -0.332812 -1.047672  0.327579
B -0.303347  0.562379  0.101916  0.010356 -1.092567
D  1.009582 -1.067280 -0.575541  0.872043 -0.172407
E  0.560147 -0.881343 -1.005952  0.578017 -0.585810
F -0.505090 -0.352065  1.530689 -0.089194  0.394503

In [87]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [88]:
dframe2

       col1      col2      col3      col4      col5
A -0.424867 -0.686707 -0.332812 -1.047672  0.327579
B -0.303347  0.562379  0.101916  0.010356 -1.092567
C       NaN       NaN       NaN       NaN       NaN
D  1.009582 -1.067280 -0.575541  0.872043 -0.172407
E  0.560147 -0.881343 -1.005952  0.578017 -0.585810
F -0.505090 -0.352065  1.530689 -0.089194  0.394503

In [90]:
new_cols = ['col1','col2','col3','col4','col5','col6','col7']

In [94]:
dframe.reindex(['A','B','C','D','E','F'],columns=new_cols)

       col1      col2      col3      col4      col5  col6  col7
A -0.424867 -0.686707 -0.332812 -1.047672  0.327579   NaN   NaN
B -0.303347  0.562379  0.101916  0.010356 -1.092567   NaN   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN   NaN
D  1.009582 -1.067280 -0.575541  0.872043 -0.172407   NaN   NaN
E  0.560147 -0.881343 -1.005952  0.578017 -0.585810   NaN   NaN
F -0.505090 -0.352065  1.530689 -0.089194  0.394503   NaN   NaN

In [96]:
dframe

       col1      col2      col3      col4      col5
A -0.424867 -0.686707 -0.332812 -1.047672  0.327579
B -0.303347  0.562379  0.101916  0.010356 -1.092567
D  1.009582 -1.067280 -0.575541  0.872043 -0.172407
E  0.560147 -0.881343 -1.005952  0.578017 -0.585810
F -0.505090 -0.352065  1.530689 -0.089194  0.394503

In [104]:
dframe.index

Index(['A', 'B', 'D', 'E', 'F'], dtype='object')

### Dropping entries from data frames and series

In [106]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [120]:
ser1 = Series(np.arange(3),index=['a','b','c'])

In [121]:
ser1

a    0
b    1
c    2
dtype: int64

In [124]:
ser1.drop('a')  #Drop command is used to drop an index from a Series

b    1
c    2
dtype: int64

In [125]:
ser1

a    0
b    1
c    2
dtype: int64

In [134]:
dframe1 = DataFrame(np.arange(9).reshape([3,3]),index=['SF','LA','NY'],columns=['pop','size','year'])

In [191]:
dframe1

     A   B   C   D   E
NY   0   1   2   3   4
TX   5   6   7   8   9
LA  10  11  12  13  14
DC  15  16  17  18  19
NJ  20  21  22  23  24

In [139]:
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [142]:
dframe1.drop('pop',axis=1)

    size  year
SF     1     2
LA     4     5
NY     7     8

In [144]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

#### Selecting entries from Data Frame and series

In [146]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [158]:
ser1 = Series(np.arange(3),index=['a','b','c'])

In [160]:
ser1

a    0
b    1
c    2
dtype: int64

In [163]:
ser1 = ser1*2

In [164]:
ser1

a    0
b    2
c    4
dtype: int64

In [174]:
ser1[0:3]

a    0
b    2
c    4
dtype: int64

In [176]:
ser1[ser1>3]

c    4
dtype: int64

In [178]:
dframe1 = DataFrame(np.arange(25).reshape([5,5]),index=['NY','TX','LA','DC','NJ'],columns=['A','B','C','D','E'])

In [180]:
dframe1

     A   B   C   D   E
NY   0   1   2   3   4
TX   5   6   7   8   9
LA  10  11  12  13  14
DC  15  16  17  18  19
NJ  20  21  22  23  24

In [202]:
dframe1['A'] > 5

NY    False
TX    False
LA     True
DC     True
NJ     True
Name: A, dtype: bool

In [203]:
dframe1[['A','B']]  #Pass columns as list to select columns from a dataframe

     A   B
NY   0   1
TX   5   6
LA  10  11
DC  15  16
NJ  20  21

In [208]:
dframe1[dframe1['A'] > 5]

     A   B   C   D   E
LA  10  11  12  13  14
DC  15  16  17  18  19
NJ  20  21  22  23  24

In [210]:
dframe1 > 15

        A      B      C      D      E
NY  False  False  False  False  False
TX  False  False  False  False  False
LA  False  False  False  False  False
DC  False   True   True   True   True
NJ   True   True   True   True   True

In [232]:
dframe1.iloc[1:3]

     A   B   C   D   E
TX   5   6   7   8   9
LA  10  11  12  13  14

In [1]:
dframe1.loc['NY':'LA'][['A','B']]

NameError: name 'dframe1' is not defined

### Data alignment

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [8]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [11]:
ser1 + ser2  #Adding 2 series. Adds only common indices.

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [32]:
#dframe1 = DataFrame(np.arange(6).reshape([3,2]),columns=list('AB'),index=['LA','NY','SF'])
dframe1 = DataFrame(np.arange(4).reshape([2,2]),columns=list('AB'),index=['LA','NY'])
dframe1

    A  B
LA  0  1
NY  2  3

In [27]:
dframe2 = DataFrame(np.arange(9).reshape([3,3]),columns=list('ADC'),index=['NY','SF','LA'])
dframe2

    A  D  C
NY  0  1  2
SF  3  4  5
LA  6  7  8

In [28]:
dframe1 + dframe2 #adding data frame. adds only common indices and columns

    A   B   C   D
LA  6 NaN NaN NaN
NY  2 NaN NaN NaN
SF  7 NaN NaN NaN

In [34]:
#adding dframe 2 to dframe 1. Indices in one but not in another will be filled with zeros
dframe1.add(dframe2,fill_value=0)

      A    B    C    D
LA  6.0  1.0  8.0  7.0
NY  2.0  3.0  2.0  1.0
SF  3.0  NaN  5.0  4.0

### Adding/subtracting dataframe to series

In [39]:
ser3 = dframe2.iloc[0]
ser3

A    0
D    1
C    2
Name: NY, dtype: int64

In [42]:
dframe2 - ser3

    A  D  C
NY  0  0  0
SF  3  3  3
LA  6  6  6

### Ranking and sorting

In [60]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [46]:
ser1 = Series(range(3),index=['C','A','B'])

In [48]:
ser1

C    0
A    1
B    2
dtype: int64

In [51]:
ser1.sort_index()  #sorting by index

A    1
B    2
C    0
dtype: int64

In [54]:
ser1.sort_values() #sorting by values

C    0
A    1
B    2
dtype: int64

In [62]:
ser2 = Series(np.random.randn(10))

In [64]:
ser2

0   -0.484703
1   -1.297487
2   -1.171819
3    0.187334
4    0.935535
5   -1.628317
6   -0.451835
7   -1.035840
8   -0.631708
9   -0.412291
dtype: float64

In [66]:
ser2.sort_index()

0   -0.484703
1   -1.297487
2   -1.171819
3    0.187334
4    0.935535
5   -1.628317
6   -0.451835
7   -1.035840
8   -0.631708
9   -0.412291
dtype: float64

In [68]:
ser2.sort_values()

5   -1.628317
1   -1.297487
2   -1.171819
7   -1.035840
8   -0.631708
0   -0.484703
6   -0.451835
9   -0.412291
3    0.187334
4    0.935535
dtype: float64

In [74]:
ser2.rank()

0     6.0
1     2.0
2     3.0
3     9.0
4    10.0
5     1.0
6     7.0
7     4.0
8     5.0
9     8.0
dtype: float64

In [75]:
ser2.sort_values().rank()

5     1.0
1     2.0
2     3.0
7     4.0
8     5.0
0     6.0
6     7.0
9     8.0
3     9.0
4    10.0
dtype: float64